PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
#include <stdio.h>
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "wifi_captive_portal.h"
#include "mqtt_manager.h"
#include "time_manager.h"
#include "watchdog_manager.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"

static const char *TAG = "HDDESP32";

// Variables globales para control del estado del sistema
static bool g_system_initialized = false;
static bool g_wifi_connected = false;
static bool g_mqtt_connected = false;
static bool g_watchdog_available = false;  // Nueva variable para tracking del watchdog

// Optimizado para ESP32 4MB - menos logs verbosos - VERSION CORREGIDA
static void print_memory_info(void) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    size_t largest_block = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    
    ESP_LOGI(TAG, "=== Memory Status ===");
    ESP_LOGI(TAG, "Free heap: %zu bytes", free_heap);
    ESP_LOGI(TAG, "Minimum free heap: %zu bytes", min_heap);
    ESP_LOGI(TAG, "Largest free block: %zu bytes", largest_block);
    
    // Reportar actividad de memoria al watchdog (solo si está disponible)
    if (g_watchdog_available) {
        esp_err_t ret = watchdog_manager_report_activity(WATCHDOG_CHECK_MEMORY);
        if (ret != ESP_OK) {
            ESP_LOGD(TAG, "Could not report memory activity to watchdog");
        }
    }
    
    if (free_heap < 50000) {
        ESP_LOGW(TAG, "Low memory warning: %zu bytes", free_heap);
        // Cambiar a modo crítico si la memoria es muy baja (solo si watchdog está disponible)
        if (free_heap < 30000 && g_watchdog_available) {
            esp_err_t mode_ret = watchdog_manager_set_mode(WATCHDOG_MODE_CRITICAL);
            if (mode_ret != ESP_OK) {
                ESP_LOGD(TAG, "Could not set watchdog to critical mode");
            }
        }
    }
}

// Callback del watchdog para eventos críticos - VERSION CORREGIDA
static void watchdog_event_callback(watchdog_health_status_t status, watchdog_check_type_t check_type, void *user_data) {
    const char* status_str = "UNKNOWN";
    const char* check_str = "UNKNOWN";
    
    switch (status) {
        case WATCHDOG_HEALTH_GOOD: status_str = "GOOD"; break;
        case WATCHDOG_HEALTH_WARNING: status_str = "WARNING"; break;
        case WATCHDOG_HEALTH_CRITICAL: status_str = "CRITICAL"; break;
        case WATCHDOG_HEALTH_ERROR: status_str = "ERROR"; break;
    }
    
    switch (check_type) {
        case WATCHDOG_CHECK_MEMORY: check_str = "MEMORY"; break;
        case WATCHDOG_CHECK_WIFI: check_str = "WIFI"; break;
        case WATCHDOG_CHECK_MQTT: check_str = "MQTT"; break;
        case WATCHDOG_CHECK_TASKS: check_str = "TASKS"; break;
    }
    
    ESP_LOGW(TAG, "Watchdog event: %s - %s", check_str, status_str);
    
    // Tomar acciones según el evento
    if (status == WATCHDOG_HEALTH_CRITICAL) {
        switch (check_type) {
            case WATCHDOG_CHECK_MEMORY:
                ESP_LOGE(TAG, "Critical memory situation detected");
                // Intentar liberación de memoria de emergencia
                mqtt_manager_emergency_memory_cleanup();
                break;
                
            case WATCHDOG_CHECK_WIFI:
                ESP_LOGE(TAG, "Critical WiFi failure detected");
                // Intentar reconexión de emergencia
                if (!wifi_manager_is_connected()) {
                    char ap_ssid[33];
                    esp_err_t ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel");
                    if (ret == ESP_OK) {
                        ESP_LOGI(TAG, "Starting emergency AP mode: %s", ap_ssid);
                        wifi_manager_start_ap_mode(ap_ssid, "firepanel");
                    }
                }
                break;
                
            case WATCHDOG_CHECK_MQTT:
                ESP_LOGE(TAG, "Critical MQTT failure detected");
                // Intentar reconexión MQTT
                char esp32_id[ESP32_ID_LENGTH + 1];
                if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                    mqtt_manager_set_esp32_id(esp32_id);
                    mqtt_manager_connect();
                }
                break;
                
            case WATCHDOG_CHECK_TASKS:
                ESP_LOGE(TAG, "Critical task failure detected");
                // Los tasks críticos no responden, el sistema se reseteará automáticamente
                break;
        }
    } else if (status == WATCHDOG_HEALTH_WARNING) {
        // Para advertencias, solo log adicional
        ESP_LOGW(TAG, "System degradation detected in %s subsystem", check_str);
    }
}

// Callback MQTT simplificado - VERSION CORREGIDA
static void mqtt_state_callback(mqtt_manager_state_t state, void *user_data) {
    switch (state) {
        case MQTT_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            g_mqtt_connected = true;
            
            // Reportar actividad MQTT (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                
                // Cambiar a modo running cuando MQTT esté conectado
                if (g_wifi_connected && g_mqtt_connected) {
                    watchdog_manager_set_mode(WATCHDOG_MODE_RUNNING);
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "MQTT disconnected");
            g_mqtt_connected = false;
            
            // Volver a modo config si perdemos MQTT (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_ERROR:
            ESP_LOGW(TAG, "MQTT error");
            g_mqtt_connected = false;
            break;
            
        default:
            break;
    }
}

// Callback mensajes MQTT simplificado - VERSION CORREGIDA
static void mqtt_message_callback(const char *topic, const char *data, int data_len, void *user_data) {
    ESP_LOGI(TAG, "MQTT message: %s (%d bytes)", topic, data_len);
    
    // Reportar actividad MQTT (solo si watchdog está disponible)
    if (g_watchdog_available) {
        esp_err_t ret = watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
        if (ret != ESP_OK) {
            ESP_LOGD(TAG, "Could not report MQTT activity to watchdog");
        }
    }
}

// WiFi callback con integración de watchdog - VERSION CORREGIDA
static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    char esp32_id[ESP32_ID_LENGTH + 1];
    
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "WiFi connected");
            g_wifi_connected = true;
            
            // Reportar actividad WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            // Sincronizar tiempo
            time_manager_sync_time();
            
            // Setup MQTT minimalista
            if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(esp32_id) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "WiFi disconnected");
            g_wifi_connected = false;
            g_mqtt_connected = false;
            
            // Volver a modo config al perder WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_AP_MODE:
            ESP_LOGI(TAG, "WiFi AP mode active");
            g_wifi_connected = false;
            
            // Permanecer en modo config (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

// Callback portal cautivo simplificado
static void on_wifi_connect_callback(void *user_data) {
    ESP_LOGI(TAG, "WiFi configured via captive portal");
    
    if (wifi_captive_portal_is_active()) {
        wifi_captive_portal_stop();
        esp_wifi_set_mode(WIFI_MODE_STA);
    }
}

// Task para monitoreo del sistema - VERSION CORREGIDA SIN wifi_manager_is_connecting()
static void system_monitor_task(void *pvParameters) {
    ESP_LOGI(TAG, "System monitor task started");
    
    // Variable para saber si el watchdog manager está disponible para este task
    bool task_watchdog_available = false;
    
    // Registrar este task en el watchdog (si está disponible)
    if (g_watchdog_available) {
        esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
        if (wd_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in watchdog manager");
            task_watchdog_available = true;
        } else {
            ESP_LOGW(TAG, "Failed to register in watchdog manager: %s", esp_err_to_name(wd_ret));
        }
    }
    
    // Si no se pudo registrar en watchdog manager, intentar con TWDT por defecto
    if (!task_watchdog_available) {
        ESP_LOGW(TAG, "Watchdog manager not available, using default ESP-IDF TWDT");
        esp_err_t twdt_ret = esp_task_wdt_add(NULL);
        if (twdt_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in default TWDT");
        } else {
            ESP_LOGW(TAG, "Failed to register in default TWDT: %s", esp_err_to_name(twdt_ret));
        }
    }
    
    uint32_t cycle_count = 0;
    
    while (1) {
        // Alimentar watchdog (usar el disponible)
        if (task_watchdog_available) {
            watchdog_manager_feed();
        } else {
            // Alimentar el TWDT por defecto
            esp_task_wdt_reset();
        }
        
        cycle_count++;
        
        // Manejar network info pendiente después de NTP sync
        if (time_manager_should_send_network_info()) {
            ESP_LOGI(TAG, "Sending network info after NTP synchronization");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Network info sent successfully");
                time_manager_mark_network_info_sent();
            } else {
                ESP_LOGW(TAG, "Failed to send network info: %s", esp_err_to_name(ret));
                // Reintentar en el siguiente ciclo
            }
        }
        
        // Limpieza agresiva de memoria si está baja
        size_t free_heap = esp_get_free_heap_size();
        if (free_heap < 40000) {  // Umbral más alto para prevención
            ESP_LOGW(TAG, "Low memory detected: %zu bytes - Performing emergency cleanup", free_heap);
            
            // Limpiar colas MQTT si es posible
            if (mqtt_manager_is_connected()) {
                ESP_LOGI(TAG, "Triggering MQTT memory cleanup");
                mqtt_manager_emergency_memory_cleanup();
            }
            
            // Forzar garbage collection si hubiera
            for (int i = 0; i < 5; i++) {
                vTaskDelay(pdMS_TO_TICKS(10));
            }
            
            size_t free_after = esp_get_free_heap_size();
            ESP_LOGI(TAG, "Memory after cleanup: %zu bytes (recovered: %d bytes)", 
                    free_after, (int)(free_after - free_heap));
        }
        
        // Memoria cada 10 minutos (reduce overhead)
        if (cycle_count % 120 == 0) {
            print_memory_info();
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        
        // Actualizar estado global
        g_wifi_connected = wifi_connected;
        g_mqtt_connected = mqtt_connected;
        
        if (wifi_connected) {
            // Reportar actividad WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            // Cambiar a modo STA si es necesario
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                esp_wifi_set_mode(WIFI_MODE_STA);
            }
            
            // Verificar tiempo - CON MANEJO DE ERRORES MEJORADO
            if (!time_manager_is_synchronized()) {
                esp_err_t time_ret = time_manager_check_sync();
                if (time_ret != ESP_OK && time_ret != ESP_ERR_NOT_FINISHED) {
                    ESP_LOGD(TAG, "Time sync check result: %s", esp_err_to_name(time_ret));
                }
            }
            
            // Procesar MQTT - CON VERIFICACIÓN DE MEMORIA
            if (free_heap > 30000) {  // Solo procesar MQTT si hay suficiente memoria
                esp_err_t mqtt_ret = mqtt_manager_loop(0);
                if (mqtt_ret != ESP_OK) {
                    ESP_LOGD(TAG, "MQTT loop result: %s", esp_err_to_name(mqtt_ret));
                }
            } else {
                ESP_LOGW(TAG, "Skipping MQTT loop due to low memory: %zu bytes", free_heap);
            }
            
            if (mqtt_connected) {
                // Reportar actividad MQTT (solo si watchdog está disponible)
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                // Log cada 2 minutos cuando todo OK
                if (cycle_count % 24 == 0) {
                    char time_str[32];
                    if (time_manager_get_lima_time_str(time_str, sizeof(time_str)) == ESP_OK) {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected, Time: %s", time_str);
                    } else {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected");
                    }
                }
            } else {
                // Reintentar MQTT cada 2 minutos - SOLO SI HAY SUFICIENTE MEMORIA
                if (cycle_count % 24 == 0 && free_heap > 50000) {
                    ESP_LOGI(TAG, "Retrying MQTT connection");
                    char esp32_id[ESP32_ID_LENGTH + 1];
                    if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(esp32_id);
                        mqtt_manager_connect();
                    }
                } else if (free_heap <= 50000) {
                    ESP_LOGW(TAG, "Skipping MQTT reconnect due to low memory: %zu bytes", free_heap);
                }
            }
        } else {
            // ← CORRECCIÓN CRÍTICA: WiFi desconectado - verificar recovery SIN wifi_manager_is_connecting()
            if (cycle_count % 12 == 0) {
                ESP_LOGI(TAG, "WiFi disconnected - attempting recovery");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 3);
            }
        }
        
        // Verificar salud del sistema (solo si watchdog está disponible)
        if (g_watchdog_available) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                ESP_LOGW(TAG, "System health degraded: %d", health);
            }
        }
        
        // Pausa optimizada
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");

    // === FASE 1: Inicialización básica ===
    ESP_LOGI(TAG, "Phase 1: Basic initialization");
    
    // Inicializar watchdog con manejo robusto de errores
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        // Si falla la inicialización del watchdog, intentar una vez más después de delay
        ESP_LOGW(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(2000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            ESP_LOGE(TAG, "Watchdog initialization failed twice, continuing without custom watchdog manager");
            ESP_LOGI(TAG, "System will use default ESP-IDF TWDT");
            g_watchdog_available = false;
        } else {
            ESP_LOGI(TAG, "Watchdog manager initialized on second attempt");
            g_watchdog_available = true;
            
            // Configurar callback del watchdog
            watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
            
            // Registrar task principal
            esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
            if (reg_ret != ESP_OK) {
                ESP_LOGW(TAG, "Failed to register main task in watchdog: %s", esp_err_to_name(reg_ret));
            }
        }
    } else {
        ESP_LOGI(TAG, "Watchdog manager initialized successfully");
        g_watchdog_available = true;
        
        // Configurar callback del watchdog
        watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
        
        // Registrar task principal
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to register main task in watchdog: %s", esp_err_to_name(reg_ret));
        }
    }
    
    // Alimentar watchdog inicialmente (solo si se inicializó correctamente)
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // Continuar con el resto de la inicialización...
    ESP_ERROR_CHECK(config_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)));
    ESP_LOGI(TAG, "ESP32 ID: %s", esp32_id);
    
    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    ESP_LOGI(TAG, "MAC: %s", mac_address);
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 2: Inicialización de managers ===
    ESP_LOGI(TAG, "Phase 2: Manager initialization");
    
    ESP_ERROR_CHECK(wifi_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(time_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(mqtt_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 3: Configuración de callbacks ===
    ESP_LOGI(TAG, "Phase 3: Callback configuration");
    
    ESP_ERROR_CHECK(wifi_manager_set_state_callback(wifi_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_state_callback(mqtt_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_message_callback(mqtt_message_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_esp32_id(esp32_id));
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 4: Conexión WiFi ===
    ESP_LOGI(TAG, "Phase 4: WiFi connection");
    
    // Intentar conexión WiFi guardada
    esp_err_t wifi_ret = wifi_manager_connect_saved();
    if (wifi_ret != ESP_OK) {
        // Iniciar portal cautivo
        char ap_ssid[33];
        ESP_ERROR_CHECK(wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel"));
        
        ESP_LOGI(TAG, "Starting captive portal: %s", ap_ssid);
        ESP_ERROR_CHECK(wifi_captive_portal_start(ap_ssid, "firepanel"));
        ESP_ERROR_CHECK(wifi_captive_portal_set_on_connect_callback(on_wifi_connect_callback, NULL));
        
        // Permanecer en modo config
        if (g_watchdog_available) {
            watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
        }
    } else {
        // WiFi conectado, iniciar servicios
        if (wifi_manager_is_connected()) {
            g_wifi_connected = true;
            time_manager_sync_time();
            mqtt_manager_connect();
        }
    }
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 5: Crear task de monitoreo ===
    ESP_LOGI(TAG, "Phase 5: Creating system monitor task");
    
    BaseType_t xReturned = xTaskCreate(
        system_monitor_task,
        "sys_monitor",
        8192,  // Stack size
        NULL,
        5,     // Priority
        NULL
    );
    
    if (xReturned != pdPASS) {
        ESP_LOGE(TAG, "Failed to create system monitor task");
        if (g_watchdog_available) {
            watchdog_manager_force_reset("task_creation_failed");
        } else {
            esp_restart();
        }
    }
    
    g_system_initialized = true;
    ESP_LOGI(TAG, "System initialization completed successfully");
    
    // === LOOP PRINCIPAL SIMPLIFICADO ===
    // El task principal ahora solo maneja el watchdog y tareas críticas
    uint32_t main_cycle = 0;
    
    while (1) {
        // Alimentar watchdog del task principal (solo si está inicializado)
        if (g_watchdog_available) {
            watchdog_manager_feed();
        } else {
            // Usar TWDT por defecto si está disponible
            esp_task_wdt_reset();
        }
        
        main_cycle++;
        
        // Verificaciones críticas cada minuto
        if (main_cycle % 12 == 0) {
            // Verificar salud del watchdog (solo si está inicializado)
            if (g_watchdog_available) {
                uint32_t feed_count, error_count;
                const char *last_reset_reason;
                
                if (watchdog_manager_get_stats(&feed_count, &error_count, &last_reset_reason) == ESP_OK) {
                    if (error_count > 0) {
                        ESP_LOGW(TAG, "Watchdog errors detected: %lu (last reset: %s)", 
                                error_count, last_reset_reason ? last_reset_reason : "none");
                    }
                }
                
                // Verificar modo del watchdog
                watchdog_mode_t current_mode = watchdog_manager_get_mode();
                if (current_mode == WATCHDOG_MODE_CRITICAL) {
                    ESP_LOGW(TAG, "System running in CRITICAL mode");
                }
            }
        }
        
        // Verificación de memoria cada 5 minutos
        if (main_cycle % 60 == 0) {
            size_t free_heap = esp_get_free_heap_size();
            if (free_heap < 30000) {
                ESP_LOGW(TAG, "Main task: Low memory detected: %zu bytes", free_heap);
            }
        }
        
        // El task principal ahora tiene un ciclo más rápido para mejor responsividad del watchdog
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}